OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/multiphase/multiphaseEulerFoam/laminar/bed/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    type            massSource;

    selectionMode   points;
    points          ((0.075 0.925 0.05));

    massFlowRate    1;

    phase           water;
    rho             thermo:rho.water;

    fieldValues
    {
        U.water         (0 0 0);
    }
}


// ************************************************************************* //
